Tekla Open API Reference for Tekla Structures 2025
ProfileItem.Select Method
 Selects the profile item in the profile database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public virtual bool Select()
Public Overridable Function Select As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace